src/main/resources/nohup.out
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Creating summariser <summary>
Created the tree successfully using TestWriteThrought.jmx
Starting standalone test @ 2023 Oct 27 08:20:09 UTC (1698394809491)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
Warning: Nashorn engine is planned to be removed from a future JDK release
summary +   9676 in 00:00:20 =  482.9/s Avg:     3 Min:     0 Max:   682 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary +  14987 in 00:00:30 =  499.6/s Avg:     1 Min:     0 Max:   218 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  24663 in 00:00:50 =  492.9/s Avg:     2 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14988 in 00:00:30 =  499.6/s Avg:     1 Min:     0 Max:   259 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  39651 in 00:01:20 =  495.4/s Avg:     2 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14988 in 00:00:30 =  499.6/s Avg:     1 Min:     0 Max:   257 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  54639 in 00:01:50 =  496.5/s Avg:     2 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14983 in 00:00:30 =  499.4/s Avg:     1 Min:     0 Max:   265 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  69622 in 00:02:20 =  497.2/s Avg:     2 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14977 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   268 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  84599 in 00:02:50 =  497.5/s Avg:     2 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14984 in 00:00:30 =  499.4/s Avg:     1 Min:     0 Max:   268 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  99583 in 00:03:20 =  497.8/s Avg:     2 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14980 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   316 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 114563 in 00:03:50 =  498.0/s Avg:     2 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14978 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   320 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 129541 in 00:04:20 =  498.2/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14983 in 00:00:30 =  499.4/s Avg:     1 Min:     0 Max:   282 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 144524 in 00:04:50 =  498.3/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14977 in 00:00:30 =  499.2/s Avg:     1 Min:     0 Max:   469 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 159501 in 00:05:20 =  498.4/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14975 in 00:00:30 =  499.2/s Avg:     1 Min:     0 Max:   291 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 174476 in 00:05:50 =  498.4/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14980 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   390 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 189456 in 00:06:20 =  498.5/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14986 in 00:00:30 =  499.5/s Avg:     1 Min:     0 Max:   252 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 204442 in 00:06:50 =  498.6/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14982 in 00:00:30 =  499.4/s Avg:     1 Min:     0 Max:   290 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 219424 in 00:07:20 =  498.6/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14978 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   300 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 234402 in 00:07:50 =  498.7/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14837 in 00:00:30 =  494.6/s Avg:     3 Min:     0 Max:   482 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 249239 in 00:08:20 =  498.4/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14978 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   329 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 264217 in 00:08:50 =  498.5/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14983 in 00:00:30 =  499.4/s Avg:     1 Min:     0 Max:   280 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 279200 in 00:09:20 =  498.5/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14981 in 00:00:30 =  499.4/s Avg:     1 Min:     0 Max:   294 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 294181 in 00:09:50 =  498.6/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14977 in 00:00:30 =  499.2/s Avg:     1 Min:     0 Max:   322 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 309158 in 00:10:20 =  498.6/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14978 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   331 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 324136 in 00:10:50 =  498.6/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14978 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   408 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 339114 in 00:11:20 =  498.7/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14977 in 00:00:30 =  499.2/s Avg:     1 Min:     0 Max:   287 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 354091 in 00:11:50 =  498.7/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14984 in 00:00:30 =  499.5/s Avg:     1 Min:     0 Max:   296 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 369075 in 00:12:20 =  498.7/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14979 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   268 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 384054 in 00:12:50 =  498.7/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14986 in 00:00:30 =  499.5/s Avg:     1 Min:     0 Max:   309 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 399040 in 00:13:20 =  498.8/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14976 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   323 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 414016 in 00:13:50 =  498.8/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14978 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   303 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 428994 in 00:14:20 =  498.8/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +  14978 in 00:00:30 =  499.3/s Avg:     1 Min:     0 Max:   317 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 443972 in 00:14:50 =  498.8/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
summary +   5043 in 00:00:10 =  499.5/s Avg:     2 Min:     0 Max:   353 Err:     0 (0.00%) Active: 0 Started: 50 Finished: 50
summary = 449015 in 00:15:00 =  498.8/s Avg:     1 Min:     0 Max:   682 Err:     0 (0.00%)
Tidying up ...    @ 2023 Oct 27 08:35:10 UTC (1698395710100)
... end of run
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Creating summariser <summary>
Created the tree successfully using TestWriteThrought.jmx
Starting standalone test @ 2023 Oct 27 09:05:44 UTC (1698397544127)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
Warning: Nashorn engine is planned to be removed from a future JDK release
summary +   7567 in 00:00:15 =  491.8/s Avg:     1 Min:     0 Max:   256 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:   106 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  22567 in 00:00:45 =  497.2/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     1 Min:     0 Max:   131 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  37567 in 00:01:15 =  498.3/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    86 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  52567 in 00:01:45 =  498.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  67567 in 00:02:15 =  499.1/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:   107 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  82567 in 00:02:45 =  499.2/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    47 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary =  97567 in 00:03:15 =  499.4/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     3 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 112567 in 00:03:45 =  499.4/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    79 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 127567 in 00:04:15 =  499.5/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 142567 in 00:04:45 =  499.6/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    76 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 157567 in 00:05:15 =  499.6/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 172567 in 00:05:45 =  499.6/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    79 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 187567 in 00:06:15 =  499.7/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 202567 in 00:06:45 =  499.7/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    82 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 217567 in 00:07:15 =  499.7/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     5 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 232567 in 00:07:45 =  499.7/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    83 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 247567 in 00:08:15 =  499.7/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 262567 in 00:08:45 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    82 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 277567 in 00:09:15 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 292567 in 00:09:45 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    78 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 307567 in 00:10:15 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 322567 in 00:10:45 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    80 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 337567 in 00:11:15 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     5 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 352567 in 00:11:45 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    77 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 367567 in 00:12:15 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     4 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 382567 in 00:12:45 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    84 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 397567 in 00:13:15 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     5 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 412567 in 00:13:45 =  499.8/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:    82 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 427567 in 00:14:15 =  499.9/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +  15000 in 00:00:30 =  500.0/s Avg:     0 Min:     0 Max:     3 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
summary = 442567 in 00:14:45 =  499.9/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
summary +   7371 in 00:00:15 =  499.7/s Avg:     0 Min:     0 Max:     3 Err:     0 (0.00%) Active: 0 Started: 50 Finished: 50
summary = 449938 in 00:15:00 =  499.9/s Avg:     0 Min:     0 Max:   256 Err:     0 (0.00%)
Tidying up ...    @ 2023 Oct 27 09:20:44 UTC (1698398444753)
... end of run